"""
1) Реализуйте программу, которая принимает последовательность чисел и выводит их сумму.

2) Реализуйте программу, которая будет вычислять количество различных объектов в списке.
"""

# ============================================     tasks 1-5   =========================================================

from collections import Counter


def task1():
    n = int(input())
    print(sum([int(input()) for _ in range(n)]))


def task2(objects):
    return len(set([id(el) for el in objects]))

# ============================================     MAIN     ===========================================================


def main():
    # print(Counter([1, 2, 1, 2, 3, True, 'wef']))
    assert task2([1, 2, 1, 2, 3]) == 3
    assert task2([1, 2, 1, 2, 3, True]) == 4


if __name__ == '__main__':
    main()
