"""
1) Вектор A содержит float числа как больше, так и меньше нуля.
Округлите их до целых и результат запишите в переменную Z. Округление должно быть "от нуля", т.е.:
- положительные числа округляем всегда вверх до целого
- отрицательные числа округляем всегда вниз до целого
- 0 остаётся 0


"""

import datetime
from functools import reduce
import numpy as np


# ============================================     tasks 1-5   =========================================================


def task1(z):
    return np.append(np.append(np.floor(z[z < 0]), z[z == 0]), np.ceil(z[z > 0]))


# ============================================     MAIN     ===========================================================


def main():
    print(task1(np.array([-3.1, -5.9, 0, 0.0, 2.2, 9.8])))



if __name__ == '__main__':
    main()
