"""
1) На столе лежат n кучек в каждой из которых каоке-то кол-во бумажек.
Разрешается за 1 ход игры добавить к 2 любым кучкам по 1 бумажке.
Можно ли по правилам игры уравнять число бумажек в кучках?


"""


# ============================================     tasks 1-5   =========================================================


def task1(inp):
    if len(inp) > 2:
        if (sum(inp) % 2 != 0) and (len(inp) % 2 == 0):
            print('Кучки нельзя уравнять')
        else:
            print('Кучки можно уравнять')
    elif len(inp) == 2:
        if inp[0] == inp[1]:
            print('Кучки можно уравнять')
        else:
            print('Кучки нельзя уравнять')
    else:
        print('Ошибка. Кучек слишком мало, чтобы можно было решить задачу.')


# ============================================     MAIN     ===========================================================


def main():
    task1([1, 2, 3, 4])


if __name__ == '__main__':
    main()
