"""
1)Напишите функцию, для нахождения двойного факториала числа dfactorial(n).
Двойной факториал числа n обозначается n‼ и определяется как произведение всех натуральных чисел в отрезке [1,n],
имеющих ту же чётность, что и n.


"""


# ============================================     task 1-5  ===========================================================

def task1(n):
    return n * task1(n - 2) if n > 1 else 1

# ============================================     MAIN     ===========================================================


def main():
    print('START')


if __name__ == '__main__':
    main()


# ============================================     TESTS     ===========================================================

def test_task1():
    assert task1(0) == 1
    assert task1(2) == 2
    assert task1(4) == 8
    assert task1(5) == 15
