"""
1) Найдите предел функции f(x)
x→+∞
x→−∞
Ответ округлите до 3 знака после запятой.


2) Напишите функцию derivative(f, x0=0), находящую производную функции
f(x) в точке x=x0
Функция должна принимать 2 параметра:
обязательный - f - имя функции (без скобочек)
необязательный - x0 - значение аргумента точки в которой вычисляется производная.
Если не задан, то значение будет равно 0.
Функция должна округлять ответ до 3 знака после запятой.



"""

# ============================================     tasks  ===========================================================

from math import *


def f(x):
    return (2 * x**2 - 3 * x - 5) / (3 * x**2 + x + 1)


def f2(x):
    return sin(pi * x / 2) / x


def derivative(fun, x0=0):
    dx = 0.00001
    return (fun(x0+dx) - fun(x0)) / dx
# ============================================     MAIN     ===========================================================


def main():
    # print(round(f(1e10), 3))
    # print(round(f(-1e10), 3))
    # print(round(f2(1e10), 3))

    print(round(derivative(sin), 3))


if __name__ == '__main__':
    main()